solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_SLEEPCON0.h
#define SLEEPCON0_WAKEUPEN3_PINT0_INTR5_MASK     (0x10000U)
#define SLEEPCON0_WAKEUPEN3_PINT0_INTR5_SHIFT    (16U)
/*! PINT0_INTR5 - PINT0_INTR5 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN3_PINT0_INTR5(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_PINT0_INTR5_SHIFT)) & SLEEPCON0_WAKEUPEN3_PINT0_INTR5_MASK)

#define SLEEPCON0_WAKEUPEN3_PINT0_INTR6_MASK     (0x20000U)
#define SLEEPCON0_WAKEUPEN3_PINT0_INTR6_SHIFT    (17U)
/*! PINT0_INTR6 - PINT0_INTR6 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN3_PINT0_INTR6(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_PINT0_INTR6_SHIFT)) & SLEEPCON0_WAKEUPEN3_PINT0_INTR6_MASK)

#define SLEEPCON0_WAKEUPEN3_PINT0_INTR7_MASK     (0x40000U)
#define SLEEPCON0_WAKEUPEN3_PINT0_INTR7_SHIFT    (18U)
/*! PINT0_INTR7 - PINT0_INTR7 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN3_PINT0_INTR7(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_PINT0_INTR7_SHIFT)) & SLEEPCON0_WAKEUPEN3_PINT0_INTR7_MASK)

#define SLEEPCON0_WAKEUPEN3_SAI0_MASK            (0x80000U)
#define SLEEPCON0_WAKEUPEN3_SAI0_SHIFT           (19U)
/*! SAI0 - SAI0 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN3_SAI0(x)              (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_SAI0_SHIFT)) & SLEEPCON0_WAKEUPEN3_SAI0_MASK)

#define SLEEPCON0_WAKEUPEN3_SAI1_MASK            (0x100000U)
#define SLEEPCON0_WAKEUPEN3_SAI1_SHIFT           (20U)
/*! SAI1 - SAI1 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN3_SAI1(x)              (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_SAI1_SHIFT)) & SLEEPCON0_WAKEUPEN3_SAI1_MASK)

#define SLEEPCON0_WAKEUPEN3_SAI2_MASK            (0x200000U)
#define SLEEPCON0_WAKEUPEN3_SAI2_SHIFT           (21U)
/*! SAI2 - SAI2 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN3_SAI2(x)              (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_SAI2_SHIFT)) & SLEEPCON0_WAKEUPEN3_SAI2_MASK)
/*! @} */

/*! @name WAKEUPEN4 - Wakeup Enable 4 */
/*! @{ */

#define SLEEPCON0_WAKEUPEN4_ITRC_MASK            (0x10U)
#define SLEEPCON0_WAKEUPEN4_ITRC_SHIFT           (4U)
/*! ITRC - ITRC Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN4_ITRC(x)              (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN4_ITRC_SHIFT)) & SLEEPCON0_WAKEUPEN4_ITRC_MASK)

#define SLEEPCON0_WAKEUPEN4_PMC0_MASK            (0x400U)
#define SLEEPCON0_WAKEUPEN4_PMC0_SHIFT           (10U)
/*! PMC0 - PMC0 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN4_PMC0(x)              (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN4_PMC0_SHIFT)) & SLEEPCON0_WAKEUPEN4_PMC0_MASK)

#define SLEEPCON0_WAKEUPEN4_FRO0_MASK            (0x4000000U)
#define SLEEPCON0_WAKEUPEN4_FRO0_SHIFT           (26U)
/*! FRO0 - FRO0 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN4_FRO0(x)              (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN4_FRO0_SHIFT)) & SLEEPCON0_WAKEUPEN4_FRO0_MASK)

#define SLEEPCON0_WAKEUPEN4_FRO1_MASK            (0x8000000U)
#define SLEEPCON0_WAKEUPEN4_FRO1_SHIFT           (27U)
/*! FRO1 - FRO1 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN4_FRO1(x)              (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN4_FRO1_SHIFT)) & SLEEPCON0_WAKEUPEN4_FRO1_MASK)

#define SLEEPCON0_WAKEUPEN4_FRO2_MASK            (0x10000000U)
#define SLEEPCON0_WAKEUPEN4_FRO2_SHIFT           (28U)
/*! FRO2 - FRO2 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON0_WAKEUPEN4_FRO2(x)              (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN4_FRO2_SHIFT)) & SLEEPCON0_WAKEUPEN4_FRO2_MASK)
/*! @} */

/*! @name WAKEUPEN0_SET - Wakeup Enable 0 Set */
/*! @{ */

#define SLEEPCON0_WAKEUPEN0_SET_UTICK0_MASK      (0x2U)
#define SLEEPCON0_WAKEUPEN0_SET_UTICK0_SHIFT     (1U)
/*! UTICK0 - UTICK0 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN0_SET_UTICK0(x)        (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_SET_UTICK0_SHIFT)) & SLEEPCON0_WAKEUPEN0_SET_UTICK0_MASK)

#define SLEEPCON0_WAKEUPEN0_SET_CTIMER0_MASK     (0x8U)
#define SLEEPCON0_WAKEUPEN0_SET_CTIMER0_SHIFT    (3U)
/*! CTIMER0 - CTIMER0 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN0_SET_CTIMER0(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_SET_CTIMER0_SHIFT)) & SLEEPCON0_WAKEUPEN0_SET_CTIMER0_MASK)

#define SLEEPCON0_WAKEUPEN0_SET_CTIMER1_MASK     (0x10U)
#define SLEEPCON0_WAKEUPEN0_SET_CTIMER1_SHIFT    (4U)
/*! CTIMER1 - CTIMER1 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN0_SET_CTIMER1(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_SET_CTIMER1_SHIFT)) & SLEEPCON0_WAKEUPEN0_SET_CTIMER1_MASK)

#define SLEEPCON0_WAKEUPEN0_SET_CTIMER3_MASK     (0x40U)
#define SLEEPCON0_WAKEUPEN0_SET_CTIMER3_SHIFT    (6U)
/*! CTIMER3 - CTIMER3 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN0_SET_CTIMER3(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_SET_CTIMER3_SHIFT)) & SLEEPCON0_WAKEUPEN0_SET_CTIMER3_MASK)

#define SLEEPCON0_WAKEUPEN0_SET_LP_FLEXCOMM0_MASK (0x80U)
#define SLEEPCON0_WAKEUPEN0_SET_LP_FLEXCOMM0_SHIFT (7U)
/*! LP_FLEXCOMM0 - LP_FLEXCOMM0 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN0_SET_LP_FLEXCOMM0(x)  (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_SET_LP_FLEXCOMM0_SHIFT)) & SLEEPCON0_WAKEUPEN0_SET_LP_FLEXCOMM0_MASK)

#define SLEEPCON0_WAKEUPEN0_SET_LP_FLEXCOMM1_MASK (0x100U)
#define SLEEPCON0_WAKEUPEN0_SET_LP_FLEXCOMM1_SHIFT (8U)
/*! LP_FLEXCOMM1 - LP_FLEXCOMM1 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN0_SET_LP_FLEXCOMM1(x)  (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_SET_LP_FLEXCOMM1_SHIFT)) & SLEEPCON0_WAKEUPEN0_SET_LP_FLEXCOMM1_MASK)

#define SLEEPCON0_WAKEUPEN0_SET_LP_FLEXCOMM2_MASK (0x200U)
#define SLEEPCON0_WAKEUPEN0_SET_LP_FLEXCOMM2_SHIFT (9U)
/*! LP_FLEXCOMM2 - LP_FLEXCOMM2 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN0_SET_LP_FLEXCOMM2(x)  (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_SET_LP_FLEXCOMM2_SHIFT)) & SLEEPCON0_WAKEUPEN0_SET_LP_FLEXCOMM2_MASK)

#define SLEEPCON0_WAKEUPEN0_SET_LP_FLEXCOMM3_MASK (0x400U)
#define SLEEPCON0_WAKEUPEN0_SET_LP_FLEXCOMM3_SHIFT (10U)
/*! LP_FLEXCOMM3 - LP_FLEXCOMM3 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN0_SET_LP_FLEXCOMM3(x)  (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_SET_LP_FLEXCOMM3_SHIFT)) & SLEEPCON0_WAKEUPEN0_SET_LP_FLEXCOMM3_MASK)

#define SLEEPCON0_WAKEUPEN0_SET_LP_FLEXCOMM4_MASK (0x800U)
#define SLEEPCON0_WAKEUPEN0_SET_LP_FLEXCOMM4_SHIFT (11U)
/*! LP_FLEXCOMM4 - LP_FLEXCOMM4 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN0_SET_LP_FLEXCOMM4(x)  (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_SET_LP_FLEXCOMM4_SHIFT)) & SLEEPCON0_WAKEUPEN0_SET_LP_FLEXCOMM4_MASK)

#define SLEEPCON0_WAKEUPEN0_SET_LP_FLEXCOMM5_MASK (0x1000U)
#define SLEEPCON0_WAKEUPEN0_SET_LP_FLEXCOMM5_SHIFT (12U)
/*! LP_FLEXCOMM5 - LP_FLEXCOMM5 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN0_SET_LP_FLEXCOMM5(x)  (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_SET_LP_FLEXCOMM5_SHIFT)) & SLEEPCON0_WAKEUPEN0_SET_LP_FLEXCOMM5_MASK)

