solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_SLEEPCON0.h
#define SLEEPCON0_WAKEUPEN0_SET_LPSPI14_MASK     (0x2000U)
#define SLEEPCON0_WAKEUPEN0_SET_LPSPI14_SHIFT    (13U)
/*! LPSPI14 - LPSPI14 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN0_SET_LPSPI14(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_SET_LPSPI14_SHIFT)) & SLEEPCON0_WAKEUPEN0_SET_LPSPI14_MASK)

#define SLEEPCON0_WAKEUPEN0_SET_LPI2C15_MASK     (0x4000U)
#define SLEEPCON0_WAKEUPEN0_SET_LPI2C15_SHIFT    (14U)
/*! LPI2C15 - LPI2C15 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN0_SET_LPI2C15(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_SET_LPI2C15_SHIFT)) & SLEEPCON0_WAKEUPEN0_SET_LPI2C15_MASK)

#define SLEEPCON0_WAKEUPEN0_SET_ADC0_MASK        (0x8000U)
#define SLEEPCON0_WAKEUPEN0_SET_ADC0_SHIFT       (15U)
/*! ADC0 - ADC0 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN0_SET_ADC0(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_SET_ADC0_SHIFT)) & SLEEPCON0_WAKEUPEN0_SET_ADC0_MASK)

#define SLEEPCON0_WAKEUPEN0_SET_ACMP0_MASK       (0x20000U)
#define SLEEPCON0_WAKEUPEN0_SET_ACMP0_SHIFT      (17U)
/*! ACMP0 - ACMP0 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN0_SET_ACMP0(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_SET_ACMP0_SHIFT)) & SLEEPCON0_WAKEUPEN0_SET_ACMP0_MASK)

#define SLEEPCON0_WAKEUPEN0_SET_MICFIL_RD_ERR_MASK (0x40000U)
#define SLEEPCON0_WAKEUPEN0_SET_MICFIL_RD_ERR_SHIFT (18U)
/*! MICFIL_RD_ERR - MICFIL Read Data Error Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN0_SET_MICFIL_RD_ERR(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_SET_MICFIL_RD_ERR_SHIFT)) & SLEEPCON0_WAKEUPEN0_SET_MICFIL_RD_ERR_MASK)

#define SLEEPCON0_WAKEUPEN0_SET_MICFIL_WKUP_MASK (0x80000U)
#define SLEEPCON0_WAKEUPEN0_SET_MICFIL_WKUP_SHIFT (19U)
/*! MICFIL_WKUP - MICFIL Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN0_SET_MICFIL_WKUP(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_SET_MICFIL_WKUP_SHIFT)) & SLEEPCON0_WAKEUPEN0_SET_MICFIL_WKUP_MASK)

#define SLEEPCON0_WAKEUPEN0_SET_RTC0_ALARM_MASK  (0x4000000U)
#define SLEEPCON0_WAKEUPEN0_SET_RTC0_ALARM_SHIFT (26U)
/*! RTC0_ALARM - RTC0_ALARM Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN0_SET_RTC0_ALARM(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_SET_RTC0_ALARM_SHIFT)) & SLEEPCON0_WAKEUPEN0_SET_RTC0_ALARM_MASK)

#define SLEEPCON0_WAKEUPEN0_SET_RTC0_WKUP_MASK   (0x8000000U)
#define SLEEPCON0_WAKEUPEN0_SET_RTC0_WKUP_SHIFT  (27U)
/*! RTC0_WKUP - RTC0_WKUP Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN0_SET_RTC0_WKUP(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_SET_RTC0_WKUP_SHIFT)) & SLEEPCON0_WAKEUPEN0_SET_RTC0_WKUP_MASK)

#define SLEEPCON0_WAKEUPEN0_SET_MU0_MUA_MASK     (0x20000000U)
#define SLEEPCON0_WAKEUPEN0_SET_MU0_MUA_SHIFT    (29U)
/*! MU0_MUA - MU0_MUA Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN0_SET_MU0_MUA(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_SET_MU0_MUA_SHIFT)) & SLEEPCON0_WAKEUPEN0_SET_MU0_MUA_MASK)

#define SLEEPCON0_WAKEUPEN0_SET_MU1_MUA_MASK     (0x40000000U)
#define SLEEPCON0_WAKEUPEN0_SET_MU1_MUA_SHIFT    (30U)
/*! MU1_MUA - MU1_MUA Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN0_SET_MU1_MUA(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_SET_MU1_MUA_SHIFT)) & SLEEPCON0_WAKEUPEN0_SET_MU1_MUA_MASK)

#define SLEEPCON0_WAKEUPEN0_SET_MU4_MUA_MASK     (0x80000000U)
#define SLEEPCON0_WAKEUPEN0_SET_MU4_MUA_SHIFT    (31U)
/*! MU4_MUA - MU4_MUA Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN0_SET_MU4_MUA(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_SET_MU4_MUA_SHIFT)) & SLEEPCON0_WAKEUPEN0_SET_MU4_MUA_MASK)
/*! @} */

/*! @name WAKEUPEN1_SET - Wakeup Enable 1 Set */
/*! @{ */

#define SLEEPCON0_WAKEUPEN1_SET_CTIMER2_MASK     (0x1U)
#define SLEEPCON0_WAKEUPEN1_SET_CTIMER2_SHIFT    (0U)
/*! CTIMER2 - CTIMER2 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN1_SET_CTIMER2(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN1_SET_CTIMER2_SHIFT)) & SLEEPCON0_WAKEUPEN1_SET_CTIMER2_MASK)

#define SLEEPCON0_WAKEUPEN1_SET_CTIMER4_MASK     (0x2U)
#define SLEEPCON0_WAKEUPEN1_SET_CTIMER4_SHIFT    (1U)
/*! CTIMER4 - CTIMER4 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN1_SET_CTIMER4(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN1_SET_CTIMER4_SHIFT)) & SLEEPCON0_WAKEUPEN1_SET_CTIMER4_MASK)

#define SLEEPCON0_WAKEUPEN1_SET_OSTIMER_MASK     (0x4U)
#define SLEEPCON0_WAKEUPEN1_SET_OSTIMER_SHIFT    (2U)
/*! OSTIMER - OSTIMER Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN1_SET_OSTIMER(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN1_SET_OSTIMER_SHIFT)) & SLEEPCON0_WAKEUPEN1_SET_OSTIMER_MASK)

#define SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM6_MASK (0x8U)
#define SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM6_SHIFT (3U)
/*! LP_FLEXCOMM6 - LP_FLEXCOMM6 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM6(x)  (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM6_SHIFT)) & SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM6_MASK)

#define SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM7_MASK (0x10U)
#define SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM7_SHIFT (4U)
/*! LP_FLEXCOMM7 - LP_FLEXCOMM7 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM7(x)  (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM7_SHIFT)) & SLEEPCON0_WAKEUPEN1_SET_LP_FLEXCOMM7_MASK)

#define SLEEPCON0_WAKEUPEN1_SET_I3C0_MASK        (0x80U)
#define SLEEPCON0_WAKEUPEN1_SET_I3C0_SHIFT       (7U)
/*! I3C0 - I3C0 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN1_SET_I3C0(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN1_SET_I3C0_SHIFT)) & SLEEPCON0_WAKEUPEN1_SET_I3C0_MASK)

#define SLEEPCON0_WAKEUPEN1_SET_USB0_MASK        (0x100U)
#define SLEEPCON0_WAKEUPEN1_SET_USB0_SHIFT       (8U)
/*! USB0 - USB0 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN1_SET_USB0(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN1_SET_USB0_SHIFT)) & SLEEPCON0_WAKEUPEN1_SET_USB0_MASK)

#define SLEEPCON0_WAKEUPEN1_SET_USB1_MASK        (0x200U)
#define SLEEPCON0_WAKEUPEN1_SET_USB1_SHIFT       (9U)
/*! USB1 - USB1 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN1_SET_USB1(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN1_SET_USB1_SHIFT)) & SLEEPCON0_WAKEUPEN1_SET_USB1_MASK)

#define SLEEPCON0_WAKEUPEN1_SET_WWDT0_MASK       (0x400U)
#define SLEEPCON0_WAKEUPEN1_SET_WWDT0_SHIFT      (10U)
/*! WWDT0 - WWDT0 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN1_SET_WWDT0(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN1_SET_WWDT0_SHIFT)) & SLEEPCON0_WAKEUPEN1_SET_WWDT0_MASK)

#define SLEEPCON0_WAKEUPEN1_SET_WWDT1_MASK       (0x800U)
#define SLEEPCON0_WAKEUPEN1_SET_WWDT1_SHIFT      (11U)
/*! WWDT1 - WWDT1 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN1_SET_WWDT1(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN1_SET_WWDT1_SHIFT)) & SLEEPCON0_WAKEUPEN1_SET_WWDT1_MASK)

