solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_SLEEPCON0.h
#define SLEEPCON0_WAKEUPEN2_SET_EDMA1_CH12_MASK  (0x800000U)
#define SLEEPCON0_WAKEUPEN2_SET_EDMA1_CH12_SHIFT (23U)
/*! EDMA1_CH12 - eDMA1 Channel 12 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN2_SET_EDMA1_CH12(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_SET_EDMA1_CH12_SHIFT)) & SLEEPCON0_WAKEUPEN2_SET_EDMA1_CH12_MASK)

#define SLEEPCON0_WAKEUPEN2_SET_EDMA1_CH13_MASK  (0x1000000U)
#define SLEEPCON0_WAKEUPEN2_SET_EDMA1_CH13_SHIFT (24U)
/*! EDMA1_CH13 - eDMA1 Channel 13 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN2_SET_EDMA1_CH13(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_SET_EDMA1_CH13_SHIFT)) & SLEEPCON0_WAKEUPEN2_SET_EDMA1_CH13_MASK)

#define SLEEPCON0_WAKEUPEN2_SET_EDMA1_CH14_MASK  (0x2000000U)
#define SLEEPCON0_WAKEUPEN2_SET_EDMA1_CH14_SHIFT (25U)
/*! EDMA1_CH14 - eDMA1 Channel 14 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN2_SET_EDMA1_CH14(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_SET_EDMA1_CH14_SHIFT)) & SLEEPCON0_WAKEUPEN2_SET_EDMA1_CH14_MASK)

#define SLEEPCON0_WAKEUPEN2_SET_EDMA1_CH15_MASK  (0x4000000U)
#define SLEEPCON0_WAKEUPEN2_SET_EDMA1_CH15_SHIFT (26U)
/*! EDMA1_CH15 - eDMA1 Channel 15 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN2_SET_EDMA1_CH15(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_SET_EDMA1_CH15_SHIFT)) & SLEEPCON0_WAKEUPEN2_SET_EDMA1_CH15_MASK)

#define SLEEPCON0_WAKEUPEN2_SET_GPIO0_CH0_MASK   (0x8000000U)
#define SLEEPCON0_WAKEUPEN2_SET_GPIO0_CH0_SHIFT  (27U)
/*! GPIO0_CH0 - GPIO0 Channel 0 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN2_SET_GPIO0_CH0(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_SET_GPIO0_CH0_SHIFT)) & SLEEPCON0_WAKEUPEN2_SET_GPIO0_CH0_MASK)

#define SLEEPCON0_WAKEUPEN2_SET_GPIO0_CH1_MASK   (0x10000000U)
#define SLEEPCON0_WAKEUPEN2_SET_GPIO0_CH1_SHIFT  (28U)
/*! GPIO0_CH1 - GPIO0 Channel 1 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN2_SET_GPIO0_CH1(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_SET_GPIO0_CH1_SHIFT)) & SLEEPCON0_WAKEUPEN2_SET_GPIO0_CH1_MASK)

#define SLEEPCON0_WAKEUPEN2_SET_GPIO1_CH0_MASK   (0x20000000U)
#define SLEEPCON0_WAKEUPEN2_SET_GPIO1_CH0_SHIFT  (29U)
/*! GPIO1_CH0 - GPIO1 Channel 0 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN2_SET_GPIO1_CH0(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_SET_GPIO1_CH0_SHIFT)) & SLEEPCON0_WAKEUPEN2_SET_GPIO1_CH0_MASK)

#define SLEEPCON0_WAKEUPEN2_SET_GPIO1_CH1_MASK   (0x40000000U)
#define SLEEPCON0_WAKEUPEN2_SET_GPIO1_CH1_SHIFT  (30U)
/*! GPIO1_CH1 - GPIO1 Channel 1 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN2_SET_GPIO1_CH1(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_SET_GPIO1_CH1_SHIFT)) & SLEEPCON0_WAKEUPEN2_SET_GPIO1_CH1_MASK)

#define SLEEPCON0_WAKEUPEN2_SET_GPIO2_CH0_MASK   (0x80000000U)
#define SLEEPCON0_WAKEUPEN2_SET_GPIO2_CH0_SHIFT  (31U)
/*! GPIO2_CH0 - GPIO2 Channel 0 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN2_SET_GPIO2_CH0(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN2_SET_GPIO2_CH0_SHIFT)) & SLEEPCON0_WAKEUPEN2_SET_GPIO2_CH0_MASK)
/*! @} */

/*! @name WAKEUPEN3_SET - Wakeup Enable 3 Set */
/*! @{ */

#define SLEEPCON0_WAKEUPEN3_SET_GPIO2_CH1_MASK   (0x1U)
#define SLEEPCON0_WAKEUPEN3_SET_GPIO2_CH1_SHIFT  (0U)
/*! GPIO2_CH1 - GPIO2 Channel 1 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN3_SET_GPIO2_CH1(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_SET_GPIO2_CH1_SHIFT)) & SLEEPCON0_WAKEUPEN3_SET_GPIO2_CH1_MASK)

#define SLEEPCON0_WAKEUPEN3_SET_GPIO3_CH0_MASK   (0x2U)
#define SLEEPCON0_WAKEUPEN3_SET_GPIO3_CH0_SHIFT  (1U)
/*! GPIO3_CH0 - GPIO3 Channel 0 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN3_SET_GPIO3_CH0(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_SET_GPIO3_CH0_SHIFT)) & SLEEPCON0_WAKEUPEN3_SET_GPIO3_CH0_MASK)

#define SLEEPCON0_WAKEUPEN3_SET_GPIO3_CH1_MASK   (0x4U)
#define SLEEPCON0_WAKEUPEN3_SET_GPIO3_CH1_SHIFT  (2U)
/*! GPIO3_CH1 - GPIO3 Channel 1 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN3_SET_GPIO3_CH1(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_SET_GPIO3_CH1_SHIFT)) & SLEEPCON0_WAKEUPEN3_SET_GPIO3_CH1_MASK)

#define SLEEPCON0_WAKEUPEN3_SET_GPIO4_CH0_MASK   (0x8U)
#define SLEEPCON0_WAKEUPEN3_SET_GPIO4_CH0_SHIFT  (3U)
/*! GPIO4_CH0 - GPIO4 Channel 0 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN3_SET_GPIO4_CH0(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_SET_GPIO4_CH0_SHIFT)) & SLEEPCON0_WAKEUPEN3_SET_GPIO4_CH0_MASK)

#define SLEEPCON0_WAKEUPEN3_SET_GPIO4_CH1_MASK   (0x10U)
#define SLEEPCON0_WAKEUPEN3_SET_GPIO4_CH1_SHIFT  (4U)
/*! GPIO4_CH1 - GPIO4 Channel 1 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN3_SET_GPIO4_CH1(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_SET_GPIO4_CH1_SHIFT)) & SLEEPCON0_WAKEUPEN3_SET_GPIO4_CH1_MASK)

#define SLEEPCON0_WAKEUPEN3_SET_GPIO5_CH0_MASK   (0x20U)
#define SLEEPCON0_WAKEUPEN3_SET_GPIO5_CH0_SHIFT  (5U)
/*! GPIO5_CH0 - GPIO5 Channel 0 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN3_SET_GPIO5_CH0(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_SET_GPIO5_CH0_SHIFT)) & SLEEPCON0_WAKEUPEN3_SET_GPIO5_CH0_MASK)

#define SLEEPCON0_WAKEUPEN3_SET_GPIO5_CH1_MASK   (0x40U)
#define SLEEPCON0_WAKEUPEN3_SET_GPIO5_CH1_SHIFT  (6U)
/*! GPIO5_CH1 - GPIO5 Channel 1 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN3_SET_GPIO5_CH1(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_SET_GPIO5_CH1_SHIFT)) & SLEEPCON0_WAKEUPEN3_SET_GPIO5_CH1_MASK)

