solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_SLEEPCON0.h
#define SLEEPCON0_WAKEUPEN3_SET_GPIO6_CH0_MASK   (0x80U)
#define SLEEPCON0_WAKEUPEN3_SET_GPIO6_CH0_SHIFT  (7U)
/*! GPIO6_CH0 - GPIO6 Channel 0 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN3_SET_GPIO6_CH0(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_SET_GPIO6_CH0_SHIFT)) & SLEEPCON0_WAKEUPEN3_SET_GPIO6_CH0_MASK)

#define SLEEPCON0_WAKEUPEN3_SET_GPIO6_CH1_MASK   (0x100U)
#define SLEEPCON0_WAKEUPEN3_SET_GPIO6_CH1_SHIFT  (8U)
/*! GPIO6_CH1 - GPIO6 Channel 1 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN3_SET_GPIO6_CH1(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_SET_GPIO6_CH1_SHIFT)) & SLEEPCON0_WAKEUPEN3_SET_GPIO6_CH1_MASK)

#define SLEEPCON0_WAKEUPEN3_SET_GPIO7_CH0_MASK   (0x200U)
#define SLEEPCON0_WAKEUPEN3_SET_GPIO7_CH0_SHIFT  (9U)
/*! GPIO7_CH0 - GPIO7 Channel 0 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN3_SET_GPIO7_CH0(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_SET_GPIO7_CH0_SHIFT)) & SLEEPCON0_WAKEUPEN3_SET_GPIO7_CH0_MASK)

#define SLEEPCON0_WAKEUPEN3_SET_GPIO7_CH1_MASK   (0x400U)
#define SLEEPCON0_WAKEUPEN3_SET_GPIO7_CH1_SHIFT  (10U)
/*! GPIO7_CH1 - GPIO7 Channel 1 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN3_SET_GPIO7_CH1(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_SET_GPIO7_CH1_SHIFT)) & SLEEPCON0_WAKEUPEN3_SET_GPIO7_CH1_MASK)

#define SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR0_MASK (0x800U)
#define SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR0_SHIFT (11U)
/*! PINT0_INTR0 - PINT0_INTR0 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR0(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR0_SHIFT)) & SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR0_MASK)

#define SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR1_MASK (0x1000U)
#define SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR1_SHIFT (12U)
/*! PINT0_INTR1 - PINT0_INTR1 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR1(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR1_SHIFT)) & SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR1_MASK)

#define SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR2_MASK (0x2000U)
#define SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR2_SHIFT (13U)
/*! PINT0_INTR2 - PINT0_INTR2 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR2(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR2_SHIFT)) & SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR2_MASK)

#define SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR3_MASK (0x4000U)
#define SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR3_SHIFT (14U)
/*! PINT0_INTR3 - PINT0_INTR3 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR3(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR3_SHIFT)) & SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR3_MASK)

#define SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR4_MASK (0x8000U)
#define SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR4_SHIFT (15U)
/*! PINT0_INTR4 - PINT0_INTR4 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR4(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR4_SHIFT)) & SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR4_MASK)

#define SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR5_MASK (0x10000U)
#define SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR5_SHIFT (16U)
/*! PINT0_INTR5 - PINT0_INTR5 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR5(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR5_SHIFT)) & SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR5_MASK)

#define SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR6_MASK (0x20000U)
#define SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR6_SHIFT (17U)
/*! PINT0_INTR6 - PINT0_INTR6 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR6(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR6_SHIFT)) & SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR6_MASK)

#define SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR7_MASK (0x40000U)
#define SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR7_SHIFT (18U)
/*! PINT0_INTR7 - PINT0_INTR7 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR7(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR7_SHIFT)) & SLEEPCON0_WAKEUPEN3_SET_PINT0_INTR7_MASK)

#define SLEEPCON0_WAKEUPEN3_SET_SAI0_MASK        (0x80000U)
#define SLEEPCON0_WAKEUPEN3_SET_SAI0_SHIFT       (19U)
/*! SAI0 - SAI0 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN3_SET_SAI0(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_SET_SAI0_SHIFT)) & SLEEPCON0_WAKEUPEN3_SET_SAI0_MASK)

#define SLEEPCON0_WAKEUPEN3_SET_SAI1_MASK        (0x100000U)
#define SLEEPCON0_WAKEUPEN3_SET_SAI1_SHIFT       (20U)
/*! SAI1 - SAI1 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN3_SET_SAI1(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_SET_SAI1_SHIFT)) & SLEEPCON0_WAKEUPEN3_SET_SAI1_MASK)

#define SLEEPCON0_WAKEUPEN3_SET_SAI2_MASK        (0x200000U)
#define SLEEPCON0_WAKEUPEN3_SET_SAI2_SHIFT       (21U)
/*! SAI2 - SAI2 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN3_SET_SAI2(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN3_SET_SAI2_SHIFT)) & SLEEPCON0_WAKEUPEN3_SET_SAI2_MASK)
/*! @} */

/*! @name WAKEUPEN4_SET - Wakeup Enable 4 Set */
/*! @{ */

#define SLEEPCON0_WAKEUPEN4_SET_ITRC_MASK        (0x10U)
#define SLEEPCON0_WAKEUPEN4_SET_ITRC_SHIFT       (4U)
/*! ITRC - ITRC Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN4_SET_ITRC(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN4_SET_ITRC_SHIFT)) & SLEEPCON0_WAKEUPEN4_SET_ITRC_MASK)

#define SLEEPCON0_WAKEUPEN4_SET_PMC0_MASK        (0x400U)
#define SLEEPCON0_WAKEUPEN4_SET_PMC0_SHIFT       (10U)
/*! PMC0 - PMC0 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN4_SET_PMC0(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN4_SET_PMC0_SHIFT)) & SLEEPCON0_WAKEUPEN4_SET_PMC0_MASK)

