solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_SLEEPCON0.h
#define SLEEPCON0_WAKEUPEN4_SET_FRO0_MASK        (0x4000000U)
#define SLEEPCON0_WAKEUPEN4_SET_FRO0_SHIFT       (26U)
/*! FRO0 - FRO0 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN4_SET_FRO0(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN4_SET_FRO0_SHIFT)) & SLEEPCON0_WAKEUPEN4_SET_FRO0_MASK)

#define SLEEPCON0_WAKEUPEN4_SET_FRO1_MASK        (0x8000000U)
#define SLEEPCON0_WAKEUPEN4_SET_FRO1_SHIFT       (27U)
/*! FRO1 - FRO1 Wake-up Enable
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN4_SET_FRO1(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN4_SET_FRO1_SHIFT)) & SLEEPCON0_WAKEUPEN4_SET_FRO1_MASK)

#define SLEEPCON0_WAKEUPEN4_SET_FRO2_MASK        (0x10000000U)
#define SLEEPCON0_WAKEUPEN4_SET_FRO2_SHIFT       (28U)
/*! FRO2 - FRO2 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON0_WAKEUPEN4_SET_FRO2(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN4_SET_FRO2_SHIFT)) & SLEEPCON0_WAKEUPEN4_SET_FRO2_MASK)
/*! @} */

/*! @name WAKEUPEN0_CLR - Wakeup Enable 0 Clear */
/*! @{ */

#define SLEEPCON0_WAKEUPEN0_CLR_UTICK0_MASK      (0x2U)
#define SLEEPCON0_WAKEUPEN0_CLR_UTICK0_SHIFT     (1U)
/*! UTICK0 - UTICK0 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN0_CLR_UTICK0(x)        (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_CLR_UTICK0_SHIFT)) & SLEEPCON0_WAKEUPEN0_CLR_UTICK0_MASK)

#define SLEEPCON0_WAKEUPEN0_CLR_CTIMER0_MASK     (0x8U)
#define SLEEPCON0_WAKEUPEN0_CLR_CTIMER0_SHIFT    (3U)
/*! CTIMER0 - CTIMER0 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN0_CLR_CTIMER0(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_CLR_CTIMER0_SHIFT)) & SLEEPCON0_WAKEUPEN0_CLR_CTIMER0_MASK)

#define SLEEPCON0_WAKEUPEN0_CLR_CTIMER1_MASK     (0x10U)
#define SLEEPCON0_WAKEUPEN0_CLR_CTIMER1_SHIFT    (4U)
/*! CTIMER1 - CTIMER1 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN0_CLR_CTIMER1(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_CLR_CTIMER1_SHIFT)) & SLEEPCON0_WAKEUPEN0_CLR_CTIMER1_MASK)

#define SLEEPCON0_WAKEUPEN0_CLR_CTIMER3_MASK     (0x40U)
#define SLEEPCON0_WAKEUPEN0_CLR_CTIMER3_SHIFT    (6U)
/*! CTIMER3 - CTIMER3 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN0_CLR_CTIMER3(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_CLR_CTIMER3_SHIFT)) & SLEEPCON0_WAKEUPEN0_CLR_CTIMER3_MASK)

#define SLEEPCON0_WAKEUPEN0_CLR_LP_FLEXCOMM0_MASK (0x80U)
#define SLEEPCON0_WAKEUPEN0_CLR_LP_FLEXCOMM0_SHIFT (7U)
/*! LP_FLEXCOMM0 - LP_FLEXCOMM0 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN0_CLR_LP_FLEXCOMM0(x)  (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_CLR_LP_FLEXCOMM0_SHIFT)) & SLEEPCON0_WAKEUPEN0_CLR_LP_FLEXCOMM0_MASK)

#define SLEEPCON0_WAKEUPEN0_CLR_LP_FLEXCOMM1_MASK (0x100U)
#define SLEEPCON0_WAKEUPEN0_CLR_LP_FLEXCOMM1_SHIFT (8U)
/*! LP_FLEXCOMM1 - LP_FLEXCOMM1 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN0_CLR_LP_FLEXCOMM1(x)  (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_CLR_LP_FLEXCOMM1_SHIFT)) & SLEEPCON0_WAKEUPEN0_CLR_LP_FLEXCOMM1_MASK)

#define SLEEPCON0_WAKEUPEN0_CLR_LP_FLEXCOMM2_MASK (0x200U)
#define SLEEPCON0_WAKEUPEN0_CLR_LP_FLEXCOMM2_SHIFT (9U)
/*! LP_FLEXCOMM2 - LP_FLEXCOMM2 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN0_CLR_LP_FLEXCOMM2(x)  (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_CLR_LP_FLEXCOMM2_SHIFT)) & SLEEPCON0_WAKEUPEN0_CLR_LP_FLEXCOMM2_MASK)

#define SLEEPCON0_WAKEUPEN0_CLR_LP_FLEXCOMM3_MASK (0x400U)
#define SLEEPCON0_WAKEUPEN0_CLR_LP_FLEXCOMM3_SHIFT (10U)
/*! LP_FLEXCOMM3 - LP_FLEXCOMM3 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN0_CLR_LP_FLEXCOMM3(x)  (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_CLR_LP_FLEXCOMM3_SHIFT)) & SLEEPCON0_WAKEUPEN0_CLR_LP_FLEXCOMM3_MASK)

#define SLEEPCON0_WAKEUPEN0_CLR_LP_FLEXCOMM4_MASK (0x800U)
#define SLEEPCON0_WAKEUPEN0_CLR_LP_FLEXCOMM4_SHIFT (11U)
/*! LP_FLEXCOMM4 - LP_FLEXCOMM4 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN0_CLR_LP_FLEXCOMM4(x)  (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_CLR_LP_FLEXCOMM4_SHIFT)) & SLEEPCON0_WAKEUPEN0_CLR_LP_FLEXCOMM4_MASK)

#define SLEEPCON0_WAKEUPEN0_CLR_LP_FLEXCOMM5_MASK (0x1000U)
#define SLEEPCON0_WAKEUPEN0_CLR_LP_FLEXCOMM5_SHIFT (12U)
/*! LP_FLEXCOMM5 - LP_FLEXCOMM5 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN0_CLR_LP_FLEXCOMM5(x)  (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_CLR_LP_FLEXCOMM5_SHIFT)) & SLEEPCON0_WAKEUPEN0_CLR_LP_FLEXCOMM5_MASK)

#define SLEEPCON0_WAKEUPEN0_CLR_LPSPI14_MASK     (0x2000U)
#define SLEEPCON0_WAKEUPEN0_CLR_LPSPI14_SHIFT    (13U)
/*! LPSPI14 - LPSPI14 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN0_CLR_LPSPI14(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_CLR_LPSPI14_SHIFT)) & SLEEPCON0_WAKEUPEN0_CLR_LPSPI14_MASK)

#define SLEEPCON0_WAKEUPEN0_CLR_LPI2C15_MASK     (0x4000U)
#define SLEEPCON0_WAKEUPEN0_CLR_LPI2C15_SHIFT    (14U)
/*! LPI2C15 - LPI2C15 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN0_CLR_LPI2C15(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_CLR_LPI2C15_SHIFT)) & SLEEPCON0_WAKEUPEN0_CLR_LPI2C15_MASK)

#define SLEEPCON0_WAKEUPEN0_CLR_ADC0_MASK        (0x8000U)
#define SLEEPCON0_WAKEUPEN0_CLR_ADC0_SHIFT       (15U)
/*! ADC0 - ADC0 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN0_CLR_ADC0(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_CLR_ADC0_SHIFT)) & SLEEPCON0_WAKEUPEN0_CLR_ADC0_MASK)

#define SLEEPCON0_WAKEUPEN0_CLR_ACMP0_MASK       (0x20000U)
#define SLEEPCON0_WAKEUPEN0_CLR_ACMP0_SHIFT      (17U)
/*! ACMP0 - ACMP0 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN0_CLR_ACMP0(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_CLR_ACMP0_SHIFT)) & SLEEPCON0_WAKEUPEN0_CLR_ACMP0_MASK)

#define SLEEPCON0_WAKEUPEN0_CLR_MICFIL_RD_ERR_MASK (0x40000U)
#define SLEEPCON0_WAKEUPEN0_CLR_MICFIL_RD_ERR_SHIFT (18U)
/*! MICFIL_RD_ERR - MICFIL Read Data Error Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN0_CLR_MICFIL_RD_ERR(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_CLR_MICFIL_RD_ERR_SHIFT)) & SLEEPCON0_WAKEUPEN0_CLR_MICFIL_RD_ERR_MASK)

#define SLEEPCON0_WAKEUPEN0_CLR_MICFIL_WKUP_MASK (0x80000U)
#define SLEEPCON0_WAKEUPEN0_CLR_MICFIL_WKUP_SHIFT (19U)
/*! MICFIL_WKUP - MICFIL Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON0_WAKEUPEN0_CLR_MICFIL_WKUP(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_WAKEUPEN0_CLR_MICFIL_WKUP_SHIFT)) & SLEEPCON0_WAKEUPEN0_CLR_MICFIL_WKUP_MASK)

