solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_SLEEPCON0.h
#define SLEEPCON0_SHA_MED_TCTRL0_NIC1_LPREQ_MASK (0x1000U)
#define SLEEPCON0_SHA_MED_TCTRL0_NIC1_LPREQ_SHIFT (12U)
/*! NIC1_LPREQ - NIC_MEDIA1 Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_SHA_MED_TCTRL0_NIC1_LPREQ(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHA_MED_TCTRL0_NIC1_LPREQ_SHIFT)) & SLEEPCON0_SHA_MED_TCTRL0_NIC1_LPREQ_MASK)
/*! @} */

/*! @name SHA_SEN_TCTRL0 - Shared VDD1_SENSE Domain Targets Low-power Control */
/*! @{ */

#define SLEEPCON0_SHA_SEN_TCTRL0_ADC0_STOP_MASK  (0x1U)
#define SLEEPCON0_SHA_SEN_TCTRL0_ADC0_STOP_SHIFT (0U)
/*! ADC0_STOP - ADC0 Stop
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_SHA_SEN_TCTRL0_ADC0_STOP(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHA_SEN_TCTRL0_ADC0_STOP_SHIFT)) & SLEEPCON0_SHA_SEN_TCTRL0_ADC0_STOP_MASK)

#define SLEEPCON0_SHA_SEN_TCTRL0_ACMP0_STOP_MASK (0x4U)
#define SLEEPCON0_SHA_SEN_TCTRL0_ACMP0_STOP_SHIFT (2U)
/*! ACMP0_STOP - ACMP0 Stop
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_SHA_SEN_TCTRL0_ACMP0_STOP(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHA_SEN_TCTRL0_ACMP0_STOP_SHIFT)) & SLEEPCON0_SHA_SEN_TCTRL0_ACMP0_STOP_MASK)

#define SLEEPCON0_SHA_SEN_TCTRL0_MICFIL_STOP_MASK (0x8U)
#define SLEEPCON0_SHA_SEN_TCTRL0_MICFIL_STOP_SHIFT (3U)
/*! MICFIL_STOP - MICFIL Stop
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_SHA_SEN_TCTRL0_MICFIL_STOP(x)  (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHA_SEN_TCTRL0_MICFIL_STOP_SHIFT)) & SLEEPCON0_SHA_SEN_TCTRL0_MICFIL_STOP_MASK)

#define SLEEPCON0_SHA_SEN_TCTRL0_LPI2C15_B_LPREQ_MASK (0x20U)
#define SLEEPCON0_SHA_SEN_TCTRL0_LPI2C15_B_LPREQ_SHIFT (5U)
/*! LPI2C15_B_LPREQ - LPI2C15 Bus Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_SHA_SEN_TCTRL0_LPI2C15_B_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHA_SEN_TCTRL0_LPI2C15_B_LPREQ_SHIFT)) & SLEEPCON0_SHA_SEN_TCTRL0_LPI2C15_B_LPREQ_MASK)

#define SLEEPCON0_SHA_SEN_TCTRL0_LPI2C15_F_LPREQ_MASK (0x80U)
#define SLEEPCON0_SHA_SEN_TCTRL0_LPI2C15_F_LPREQ_SHIFT (7U)
/*! LPI2C15_F_LPREQ - LPI2C15 Function Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_SHA_SEN_TCTRL0_LPI2C15_F_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHA_SEN_TCTRL0_LPI2C15_F_LPREQ_SHIFT)) & SLEEPCON0_SHA_SEN_TCTRL0_LPI2C15_F_LPREQ_MASK)

#define SLEEPCON0_SHA_SEN_TCTRL0_GDET3_LPREQ_MASK (0x200U)
#define SLEEPCON0_SHA_SEN_TCTRL0_GDET3_LPREQ_SHIFT (9U)
/*! GDET3_LPREQ - GDET3 Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_SHA_SEN_TCTRL0_GDET3_LPREQ(x)  (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHA_SEN_TCTRL0_GDET3_LPREQ_SHIFT)) & SLEEPCON0_SHA_SEN_TCTRL0_GDET3_LPREQ_MASK)

#define SLEEPCON0_SHA_SEN_TCTRL0_RTC_STOP_MASK   (0x80000000U)
#define SLEEPCON0_SHA_SEN_TCTRL0_RTC_STOP_SHIFT  (31U)
/*! RTC_STOP - RTC0 and RTC1 Stop
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_SHA_SEN_TCTRL0_RTC_STOP(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHA_SEN_TCTRL0_RTC_STOP_SHIFT)) & SLEEPCON0_SHA_SEN_TCTRL0_RTC_STOP_MASK)
/*! @} */

/*! @name PRIVATE_CCTRL0 - Private Resources Controllers Low-power Control 0 */
/*! @{ */

#define SLEEPCON0_PRIVATE_CCTRL0_EDMA0_STOP_MASK (0x1U)
#define SLEEPCON0_PRIVATE_CCTRL0_EDMA0_STOP_SHIFT (0U)
/*! EDMA0_STOP - eDMA0 Stop
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_CCTRL0_EDMA0_STOP(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_CCTRL0_EDMA0_STOP_SHIFT)) & SLEEPCON0_PRIVATE_CCTRL0_EDMA0_STOP_MASK)

#define SLEEPCON0_PRIVATE_CCTRL0_EDMA1_STOP_MASK (0x2U)
#define SLEEPCON0_PRIVATE_CCTRL0_EDMA1_STOP_SHIFT (1U)
/*! EDMA1_STOP - eDMA1 Stop
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_CCTRL0_EDMA1_STOP(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_CCTRL0_EDMA1_STOP_SHIFT)) & SLEEPCON0_PRIVATE_CCTRL0_EDMA1_STOP_MASK)
/*! @} */

/*! @name PRIVATE_TCTRL0 - Private Resources Targets Low-power Control 0 */
/*! @{ */

#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM0_B_LPREQ_MASK (0x1U)
#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM0_B_LPREQ_SHIFT (0U)
/*! LP_FLEXCOMM0_B_LPREQ - LP_FLEXCOMM0 Bus Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM0_B_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM0_B_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM0_B_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM1_B_LPREQ_MASK (0x2U)
#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM1_B_LPREQ_SHIFT (1U)
/*! LP_FLEXCOMM1_B_LPREQ - LP_FLEXCOMM1 Bus Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM1_B_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM1_B_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM1_B_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM2_B_LPREQ_MASK (0x4U)
#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM2_B_LPREQ_SHIFT (2U)
/*! LP_FLEXCOMM2_B_LPREQ - LP_FLEXCOMM2 Bus Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM2_B_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM2_B_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM2_B_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM3_B_LPREQ_MASK (0x8U)
#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM3_B_LPREQ_SHIFT (3U)
/*! LP_FLEXCOMM3_B_LPREQ - LP_FLEXCOMM3 Bus Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM3_B_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM3_B_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM3_B_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM4_B_LPREQ_MASK (0x10U)
#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM4_B_LPREQ_SHIFT (4U)
/*! LP_FLEXCOMM4_B_LPREQ - LP_FLEXCOMM4 Bus Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM4_B_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM4_B_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM4_B_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM5_B_LPREQ_MASK (0x20U)
#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM5_B_LPREQ_SHIFT (5U)
/*! LP_FLEXCOMM5_B_LPREQ - LP_FLEXCOMM5 Bus Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM5_B_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM5_B_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM5_B_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM6_B_LPREQ_MASK (0x40U)
#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM6_B_LPREQ_SHIFT (6U)
/*! LP_FLEXCOMM6_B_LPREQ - LP_FLEXCOMM6 Bus Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM6_B_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM6_B_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM6_B_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM7_B_LPREQ_MASK (0x80U)
#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM7_B_LPREQ_SHIFT (7U)
/*! LP_FLEXCOMM7_B_LPREQ - LP_FLEXCOMM7 Bus Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM7_B_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM7_B_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM7_B_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM8_B_LPREQ_MASK (0x100U)
#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM8_B_LPREQ_SHIFT (8U)
/*! LP_FLEXCOMM8_B_LPREQ - LP_FLEXCOMM8 Bus Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM8_B_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM8_B_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM8_B_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM9_B_LPREQ_MASK (0x200U)
#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM9_B_LPREQ_SHIFT (9U)
/*! LP_FLEXCOMM9_B_LPREQ - LP_FLEXCOMM9 Bus Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM9_B_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM9_B_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM9_B_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM10_B_LPREQ_MASK (0x400U)
#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM10_B_LPREQ_SHIFT (10U)
/*! LP_FLEXCOMM10_B_LPREQ - LP_FLEXCOMM10 Bus Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM10_B_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM10_B_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM10_B_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM11_B_LPREQ_MASK (0x800U)
#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM11_B_LPREQ_SHIFT (11U)
/*! LP_FLEXCOMM11_B_LPREQ - LP_FLEXCOMM11 Bus Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM11_B_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM11_B_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM11_B_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM12_B_LPREQ_MASK (0x1000U)
#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM12_B_LPREQ_SHIFT (12U)
/*! LP_FLEXCOMM12_B_LPREQ - LP_FLEXCOMM12 Bus Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM12_B_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM12_B_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM12_B_LPREQ_MASK)

#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM13_B_LPREQ_MASK (0x2000U)
#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM13_B_LPREQ_SHIFT (13U)
/*! LP_FLEXCOMM13_B_LPREQ - LP_FLEXCOMM13 Bus Low-Power Request
 *  0b0..No request
 *  0b1..Sends request
 */
#define SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM13_B_LPREQ(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM13_B_LPREQ_SHIFT)) & SLEEPCON0_PRIVATE_TCTRL0_LP_FLEXCOMM13_B_LPREQ_MASK)
/*! @} */

