solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_SLEEPCON0.h
#define SLEEPCON0_SHA_MEDSEN_TSTAT0_ACMP0_STOP_MASK (0x20000U)
#define SLEEPCON0_SHA_MEDSEN_TSTAT0_ACMP0_STOP_SHIFT (17U)
/*! ACMP0_STOP - ACMP0 Stop Status
 *  0b0..Not in Stop status
 *  0b1..In Stop status
 */
#define SLEEPCON0_SHA_MEDSEN_TSTAT0_ACMP0_STOP(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHA_MEDSEN_TSTAT0_ACMP0_STOP_SHIFT)) & SLEEPCON0_SHA_MEDSEN_TSTAT0_ACMP0_STOP_MASK)

#define SLEEPCON0_SHA_MEDSEN_TSTAT0_MICFIL_STOPPED_MASK (0x40000U)
#define SLEEPCON0_SHA_MEDSEN_TSTAT0_MICFIL_STOPPED_SHIFT (18U)
/*! MICFIL_STOPPED - MICFIL Stop Status
 *  0b0..Not in Stop status
 *  0b1..In Stop status
 */
#define SLEEPCON0_SHA_MEDSEN_TSTAT0_MICFIL_STOPPED(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHA_MEDSEN_TSTAT0_MICFIL_STOPPED_SHIFT)) & SLEEPCON0_SHA_MEDSEN_TSTAT0_MICFIL_STOPPED_MASK)

#define SLEEPCON0_SHA_MEDSEN_TSTAT0_LPI2C15_B_LPACCEPT_MASK (0x80000U)
#define SLEEPCON0_SHA_MEDSEN_TSTAT0_LPI2C15_B_LPACCEPT_SHIFT (19U)
/*! LPI2C15_B_LPACCEPT - LPI2C15 Bus Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_SHA_MEDSEN_TSTAT0_LPI2C15_B_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHA_MEDSEN_TSTAT0_LPI2C15_B_LPACCEPT_SHIFT)) & SLEEPCON0_SHA_MEDSEN_TSTAT0_LPI2C15_B_LPACCEPT_MASK)

#define SLEEPCON0_SHA_MEDSEN_TSTAT0_LPI2C15_F_LPACCEPT_MASK (0x100000U)
#define SLEEPCON0_SHA_MEDSEN_TSTAT0_LPI2C15_F_LPACCEPT_SHIFT (20U)
/*! LPI2C15_F_LPACCEPT - LPI2C15 Function Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_SHA_MEDSEN_TSTAT0_LPI2C15_F_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHA_MEDSEN_TSTAT0_LPI2C15_F_LPACCEPT_SHIFT)) & SLEEPCON0_SHA_MEDSEN_TSTAT0_LPI2C15_F_LPACCEPT_MASK)

#define SLEEPCON0_SHA_MEDSEN_TSTAT0_GDET3_LPACCEPT_MASK (0x400000U)
#define SLEEPCON0_SHA_MEDSEN_TSTAT0_GDET3_LPACCEPT_SHIFT (22U)
/*! GDET3_LPACCEPT - GDET3 Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_SHA_MEDSEN_TSTAT0_GDET3_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHA_MEDSEN_TSTAT0_GDET3_LPACCEPT_SHIFT)) & SLEEPCON0_SHA_MEDSEN_TSTAT0_GDET3_LPACCEPT_MASK)

#define SLEEPCON0_SHA_MEDSEN_TSTAT0_RTC_STOPPED_MASK (0x80000000U)
#define SLEEPCON0_SHA_MEDSEN_TSTAT0_RTC_STOPPED_SHIFT (31U)
/*! RTC_STOPPED - RTC0 and RTC1 Stop Status
 *  0b0..Not in Stop status
 *  0b1..In Stop status
 */
#define SLEEPCON0_SHA_MEDSEN_TSTAT0_RTC_STOPPED(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_SHA_MEDSEN_TSTAT0_RTC_STOPPED_SHIFT)) & SLEEPCON0_SHA_MEDSEN_TSTAT0_RTC_STOPPED_MASK)
/*! @} */

/*! @name PRIVATE_CSTAT0 - Private Resources Controller Low-power Status */
/*! @{ */

#define SLEEPCON0_PRIVATE_CSTAT0_EDMA0_STOP_MASK (0x1U)
#define SLEEPCON0_PRIVATE_CSTAT0_EDMA0_STOP_SHIFT (0U)
/*! EDMA0_STOP - eDMA0 Stop Status
 *  0b0..Not in Stop status
 *  0b1..In Stop status
 */
#define SLEEPCON0_PRIVATE_CSTAT0_EDMA0_STOP(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_CSTAT0_EDMA0_STOP_SHIFT)) & SLEEPCON0_PRIVATE_CSTAT0_EDMA0_STOP_MASK)

#define SLEEPCON0_PRIVATE_CSTAT0_EDMA1_STOP_MASK (0x2U)
#define SLEEPCON0_PRIVATE_CSTAT0_EDMA1_STOP_SHIFT (1U)
/*! EDMA1_STOP - eDMA1 Stop Status
 *  0b0..Not in Stop status
 *  0b1..In Stop status
 */
#define SLEEPCON0_PRIVATE_CSTAT0_EDMA1_STOP(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_CSTAT0_EDMA1_STOP_SHIFT)) & SLEEPCON0_PRIVATE_CSTAT0_EDMA1_STOP_MASK)
/*! @} */

/*! @name PRIVATE_TSTAT0 - Private Resources Targets Low-power Status 0 */
/*! @{ */

#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM0_B_LPACCEPT_MASK (0x1U)
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM0_B_LPACCEPT_SHIFT (0U)
/*! LP_FLEXCOMM0_B_LPACCEPT - LP_FLEXCOMM0 Bus Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM0_B_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM0_B_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM0_B_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM1_B_LPACCEPT_MASK (0x2U)
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM1_B_LPACCEPT_SHIFT (1U)
/*! LP_FLEXCOMM1_B_LPACCEPT - LP_FLEXCOMM1 Bus Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM1_B_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM1_B_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM1_B_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM2_B_LPACCEPT_MASK (0x4U)
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM2_B_LPACCEPT_SHIFT (2U)
/*! LP_FLEXCOMM2_B_LPACCEPT - LP_FLEXCOMM2 Bus Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM2_B_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM2_B_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM2_B_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM3_B_LPACCEPT_MASK (0x8U)
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM3_B_LPACCEPT_SHIFT (3U)
/*! LP_FLEXCOMM3_B_LPACCEPT - LP_FLEXCOMM3 Bus Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM3_B_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM3_B_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM3_B_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM4_B_LPACCEPT_MASK (0x10U)
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM4_B_LPACCEPT_SHIFT (4U)
/*! LP_FLEXCOMM4_B_LPACCEPT - LP_FLEXCOMM4 Bus Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM4_B_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM4_B_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM4_B_LPACCEPT_MASK)

#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM5_B_LPACCEPT_MASK (0x20U)
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM5_B_LPACCEPT_SHIFT (5U)
/*! LP_FLEXCOMM5_B_LPACCEPT - LP_FLEXCOMM5 Bus Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM5_B_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM5_B_LPACCEPT_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT0_LP_FLEXCOMM5_B_LPACCEPT_MASK)

