solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_SLEEPCON0.h
#define SLEEPCON0_PRIVATE_TSTAT1_I3C1_STOP_MASK  (0x20000U)
#define SLEEPCON0_PRIVATE_TSTAT1_I3C1_STOP_SHIFT (17U)
/*! I3C1_STOP - I3C1 Stop Status
 *  0b0..Not in Stop status
 *  0b1..In Stop status
 */
#define SLEEPCON0_PRIVATE_TSTAT1_I3C1_STOP(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_PRIVATE_TSTAT1_I3C1_STOP_SHIFT)) & SLEEPCON0_PRIVATE_TSTAT1_I3C1_STOP_MASK)
/*! @} */

/*! @name LP_HINT0 - Low-Power Hints 0 */
/*! @{ */

#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM0_B_LPHINT_MASK (0x1U)
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM0_B_LPHINT_SHIFT (0U)
/*! LP_FLEXCOMM0_B_LPHINT - LP_FLEXCOMM0 Bus Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM0_B_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT0_LP_FLEXCOMM0_B_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT0_LP_FLEXCOMM0_B_LPHINT_MASK)

#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM1_B_LPHINT_MASK (0x2U)
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM1_B_LPHINT_SHIFT (1U)
/*! LP_FLEXCOMM1_B_LPHINT - LP_FLEXCOMM1 Bus Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM1_B_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT0_LP_FLEXCOMM1_B_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT0_LP_FLEXCOMM1_B_LPHINT_MASK)

#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM2_B_LPHINT_MASK (0x4U)
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM2_B_LPHINT_SHIFT (2U)
/*! LP_FLEXCOMM2_B_LPHINT - LP_FLEXCOMM2 Bus Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM2_B_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT0_LP_FLEXCOMM2_B_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT0_LP_FLEXCOMM2_B_LPHINT_MASK)

#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM3_B_LPHINT_MASK (0x8U)
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM3_B_LPHINT_SHIFT (3U)
/*! LP_FLEXCOMM3_B_LPHINT - LP_FLEXCOMM3 Bus Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM3_B_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT0_LP_FLEXCOMM3_B_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT0_LP_FLEXCOMM3_B_LPHINT_MASK)

#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM4_B_LPHINT_MASK (0x10U)
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM4_B_LPHINT_SHIFT (4U)
/*! LP_FLEXCOMM4_B_LPHINT - LP_FLEXCOMM4 Bus Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM4_B_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT0_LP_FLEXCOMM4_B_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT0_LP_FLEXCOMM4_B_LPHINT_MASK)

#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM5_B_LPHINT_MASK (0x20U)
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM5_B_LPHINT_SHIFT (5U)
/*! LP_FLEXCOMM5_B_LPHINT - LP_FLEXCOMM5 Bus Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM5_B_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT0_LP_FLEXCOMM5_B_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT0_LP_FLEXCOMM5_B_LPHINT_MASK)

#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM6_B_LPHINT_MASK (0x40U)
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM6_B_LPHINT_SHIFT (6U)
/*! LP_FLEXCOMM6_B_LPHINT - LP_FLEXCOMM6 Bus Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM6_B_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT0_LP_FLEXCOMM6_B_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT0_LP_FLEXCOMM6_B_LPHINT_MASK)

#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM7_B_LPHINT_MASK (0x80U)
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM7_B_LPHINT_SHIFT (7U)
/*! LP_FLEXCOMM7_B_LPHINT - LP_FLEXCOMM7 Bus Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM7_B_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT0_LP_FLEXCOMM7_B_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT0_LP_FLEXCOMM7_B_LPHINT_MASK)

#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM8_B_LPHINT_MASK (0x100U)
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM8_B_LPHINT_SHIFT (8U)
/*! LP_FLEXCOMM8_B_LPHINT - LP_FLEXCOMM8 Bus Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM8_B_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT0_LP_FLEXCOMM8_B_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT0_LP_FLEXCOMM8_B_LPHINT_MASK)

#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM9_B_LPHINT_MASK (0x200U)
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM9_B_LPHINT_SHIFT (9U)
/*! LP_FLEXCOMM9_B_LPHINT - LP_FLEXCOMM9 Bus Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM9_B_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT0_LP_FLEXCOMM9_B_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT0_LP_FLEXCOMM9_B_LPHINT_MASK)

#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM10_B_LPHINT_MASK (0x400U)
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM10_B_LPHINT_SHIFT (10U)
/*! LP_FLEXCOMM10_B_LPHINT - LP_FLEXCOMM10 Bus Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM10_B_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT0_LP_FLEXCOMM10_B_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT0_LP_FLEXCOMM10_B_LPHINT_MASK)

#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM11_B_LPHINT_MASK (0x800U)
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM11_B_LPHINT_SHIFT (11U)
/*! LP_FLEXCOMM11_B_LPHINT - LP_FLEXCOMM11 Bus Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM11_B_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT0_LP_FLEXCOMM11_B_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT0_LP_FLEXCOMM11_B_LPHINT_MASK)

#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM12_B_LPHINT_MASK (0x1000U)
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM12_B_LPHINT_SHIFT (12U)
/*! LP_FLEXCOMM12_B_LPHINT - LP_FLEXCOMM12 Bus Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM12_B_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT0_LP_FLEXCOMM12_B_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT0_LP_FLEXCOMM12_B_LPHINT_MASK)

#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM13_B_LPHINT_MASK (0x2000U)
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM13_B_LPHINT_SHIFT (13U)
/*! LP_FLEXCOMM13_B_LPHINT - LP_FLEXCOMM13 Bus Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM13_B_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT0_LP_FLEXCOMM13_B_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT0_LP_FLEXCOMM13_B_LPHINT_MASK)

#define SLEEPCON0_LP_HINT0_LPSPI14_B_LPHINT_MASK (0x4000U)
#define SLEEPCON0_LP_HINT0_LPSPI14_B_LPHINT_SHIFT (14U)
/*! LPSPI14_B_LPHINT - LPSPI14 Bus Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT0_LPSPI14_B_LPHINT(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT0_LPSPI14_B_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT0_LPSPI14_B_LPHINT_MASK)

