solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_SLEEPCON0.h
#define SLEEPCON0_LP_HINT0_LPSPI16_B_LPHINT_MASK (0x8000U)
#define SLEEPCON0_LP_HINT0_LPSPI16_B_LPHINT_SHIFT (15U)
/*! LPSPI16_B_LPHINT - LPSPI16 Bus Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT0_LPSPI16_B_LPHINT(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT0_LPSPI16_B_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT0_LPSPI16_B_LPHINT_MASK)

#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM0_F_LPHINT_MASK (0x10000U)
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM0_F_LPHINT_SHIFT (16U)
/*! LP_FLEXCOMM0_F_LPHINT - LP_FLEXCOMM0 Function Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM0_F_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT0_LP_FLEXCOMM0_F_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT0_LP_FLEXCOMM0_F_LPHINT_MASK)

#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM1_F_LPHINT_MASK (0x20000U)
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM1_F_LPHINT_SHIFT (17U)
/*! LP_FLEXCOMM1_F_LPHINT - LP_FLEXCOMM1 Function Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM1_F_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT0_LP_FLEXCOMM1_F_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT0_LP_FLEXCOMM1_F_LPHINT_MASK)

#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM2_F_LPHINT_MASK (0x40000U)
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM2_F_LPHINT_SHIFT (18U)
/*! LP_FLEXCOMM2_F_LPHINT - LP_FLEXCOMM2 Function Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM2_F_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT0_LP_FLEXCOMM2_F_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT0_LP_FLEXCOMM2_F_LPHINT_MASK)

#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM3_F_LPHINT_MASK (0x80000U)
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM3_F_LPHINT_SHIFT (19U)
/*! LP_FLEXCOMM3_F_LPHINT - LP_FLEXCOMM3 Function Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM3_F_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT0_LP_FLEXCOMM3_F_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT0_LP_FLEXCOMM3_F_LPHINT_MASK)

#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM4_F_LPHINT_MASK (0x100000U)
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM4_F_LPHINT_SHIFT (20U)
/*! LP_FLEXCOMM4_F_LPHINT - LP_FLEXCOMM4 Function Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM4_F_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT0_LP_FLEXCOMM4_F_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT0_LP_FLEXCOMM4_F_LPHINT_MASK)

#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM5_F_LPHINT_MASK (0x200000U)
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM5_F_LPHINT_SHIFT (21U)
/*! LP_FLEXCOMM5_F_LPHINT - LP_FLEXCOMM5 Function Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM5_F_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT0_LP_FLEXCOMM5_F_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT0_LP_FLEXCOMM5_F_LPHINT_MASK)

#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM6_F_LPHINT_MASK (0x400000U)
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM6_F_LPHINT_SHIFT (22U)
/*! LP_FLEXCOMM6_F_LPHINT - LP_FLEXCOMM6 Function Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM6_F_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT0_LP_FLEXCOMM6_F_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT0_LP_FLEXCOMM6_F_LPHINT_MASK)

#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM7_F_LPHINT_MASK (0x800000U)
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM7_F_LPHINT_SHIFT (23U)
/*! LP_FLEXCOMM7_F_LPHINT - LP_FLEXCOMM7 Function Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM7_F_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT0_LP_FLEXCOMM7_F_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT0_LP_FLEXCOMM7_F_LPHINT_MASK)

#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM8_F_LPHINT_MASK (0x1000000U)
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM8_F_LPHINT_SHIFT (24U)
/*! LP_FLEXCOMM8_F_LPHINT - LP_FLEXCOMM8 Function Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM8_F_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT0_LP_FLEXCOMM8_F_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT0_LP_FLEXCOMM8_F_LPHINT_MASK)

#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM9_F_LPHINT_MASK (0x2000000U)
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM9_F_LPHINT_SHIFT (25U)
/*! LP_FLEXCOMM9_F_LPHINT - LP_FLEXCOMM9 Function Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM9_F_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT0_LP_FLEXCOMM9_F_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT0_LP_FLEXCOMM9_F_LPHINT_MASK)

#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM10_F_LPHINT_MASK (0x4000000U)
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM10_F_LPHINT_SHIFT (26U)
/*! LP_FLEXCOMM10_F_LPHINT - LP_FLEXCOMM10 Function Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM10_F_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT0_LP_FLEXCOMM10_F_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT0_LP_FLEXCOMM10_F_LPHINT_MASK)

#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM11_F_LPHINT_MASK (0x8000000U)
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM11_F_LPHINT_SHIFT (27U)
/*! LP_FLEXCOMM11_F_LPHINT - LP_FLEXCOMM11 Function Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM11_F_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT0_LP_FLEXCOMM11_F_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT0_LP_FLEXCOMM11_F_LPHINT_MASK)

#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM12_F_LPHINT_MASK (0x10000000U)
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM12_F_LPHINT_SHIFT (28U)
/*! LP_FLEXCOMM12_F_LPHINT - LP_FLEXCOMM12 Function Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM12_F_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT0_LP_FLEXCOMM12_F_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT0_LP_FLEXCOMM12_F_LPHINT_MASK)

