solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_SLEEPCON0.h
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM13_F_LPHINT_MASK (0x20000000U)
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM13_F_LPHINT_SHIFT (29U)
/*! LP_FLEXCOMM13_F_LPHINT - LP_FLEXCOMM13 Function Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT0_LP_FLEXCOMM13_F_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT0_LP_FLEXCOMM13_F_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT0_LP_FLEXCOMM13_F_LPHINT_MASK)

#define SLEEPCON0_LP_HINT0_LPSPI14_F_LPHINT_MASK (0x40000000U)
#define SLEEPCON0_LP_HINT0_LPSPI14_F_LPHINT_SHIFT (30U)
/*! LPSPI14_F_LPHINT - LPSPI14 Function Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT0_LPSPI14_F_LPHINT(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT0_LPSPI14_F_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT0_LPSPI14_F_LPHINT_MASK)

#define SLEEPCON0_LP_HINT0_LPSPI16_F_LPHINT_MASK (0x80000000U)
#define SLEEPCON0_LP_HINT0_LPSPI16_F_LPHINT_SHIFT (31U)
/*! LPSPI16_F_LPHINT - LPSPI16 Function Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT0_LPSPI16_F_LPHINT(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT0_LPSPI16_F_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT0_LPSPI16_F_LPHINT_MASK)
/*! @} */

/*! @name LP_HINT1 - Low-Power Hints 1 */
/*! @{ */

#define SLEEPCON0_LP_HINT1_GPIO0_LPHINT_MASK     (0x1U)
#define SLEEPCON0_LP_HINT1_GPIO0_LPHINT_SHIFT    (0U)
/*! GPIO0_LPHINT - GPIO0 Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT1_GPIO0_LPHINT(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_GPIO0_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT1_GPIO0_LPHINT_MASK)

#define SLEEPCON0_LP_HINT1_GPIO1_LPHINT_MASK     (0x2U)
#define SLEEPCON0_LP_HINT1_GPIO1_LPHINT_SHIFT    (1U)
/*! GPIO1_LPHINT - GPIO1 Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT1_GPIO1_LPHINT(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_GPIO1_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT1_GPIO1_LPHINT_MASK)

#define SLEEPCON0_LP_HINT1_GPIO2_LPHINT_MASK     (0x4U)
#define SLEEPCON0_LP_HINT1_GPIO2_LPHINT_SHIFT    (2U)
/*! GPIO2_LPHINT - GPIO2 Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT1_GPIO2_LPHINT(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_GPIO2_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT1_GPIO2_LPHINT_MASK)

#define SLEEPCON0_LP_HINT1_GPIO3_LPHINT_MASK     (0x8U)
#define SLEEPCON0_LP_HINT1_GPIO3_LPHINT_SHIFT    (3U)
/*! GPIO3_LPHINT - GPIO3 Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT1_GPIO3_LPHINT(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_GPIO3_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT1_GPIO3_LPHINT_MASK)

#define SLEEPCON0_LP_HINT1_GPIO4_LPHINT_MASK     (0x10U)
#define SLEEPCON0_LP_HINT1_GPIO4_LPHINT_SHIFT    (4U)
/*! GPIO4_LPHINT - GPIO4 Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT1_GPIO4_LPHINT(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_GPIO4_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT1_GPIO4_LPHINT_MASK)

#define SLEEPCON0_LP_HINT1_GPIO5_LPHINT_MASK     (0x20U)
#define SLEEPCON0_LP_HINT1_GPIO5_LPHINT_SHIFT    (5U)
/*! GPIO5_LPHINT - GPIO5 Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT1_GPIO5_LPHINT(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_GPIO5_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT1_GPIO5_LPHINT_MASK)

#define SLEEPCON0_LP_HINT1_GPIO6_LPHINT_MASK     (0x40U)
#define SLEEPCON0_LP_HINT1_GPIO6_LPHINT_SHIFT    (6U)
/*! GPIO6_LPHINT - GPIO6 Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT1_GPIO6_LPHINT(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_GPIO6_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT1_GPIO6_LPHINT_MASK)

#define SLEEPCON0_LP_HINT1_GPIO7_LPHINT_MASK     (0x80U)
#define SLEEPCON0_LP_HINT1_GPIO7_LPHINT_SHIFT    (7U)
/*! GPIO7_LPHINT - GPIO7 Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT1_GPIO7_LPHINT(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_GPIO7_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT1_GPIO7_LPHINT_MASK)

#define SLEEPCON0_LP_HINT1_SAI0_B_LPHINT_MASK    (0x100U)
#define SLEEPCON0_LP_HINT1_SAI0_B_LPHINT_SHIFT   (8U)
/*! SAI0_B_LPHINT - SAI0 Bus Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT1_SAI0_B_LPHINT(x)      (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_SAI0_B_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT1_SAI0_B_LPHINT_MASK)

#define SLEEPCON0_LP_HINT1_SAI1_B_LPHINT_MASK    (0x200U)
#define SLEEPCON0_LP_HINT1_SAI1_B_LPHINT_SHIFT   (9U)
/*! SAI1_B_LPHINT - SAI1 Bus Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT1_SAI1_B_LPHINT(x)      (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_SAI1_B_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT1_SAI1_B_LPHINT_MASK)

#define SLEEPCON0_LP_HINT1_SAI2_B_LPHINT_MASK    (0x400U)
#define SLEEPCON0_LP_HINT1_SAI2_B_LPHINT_SHIFT   (10U)
/*! SAI2_B_LPHINT - SAI2 Bus Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT1_SAI2_B_LPHINT(x)      (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_SAI2_B_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT1_SAI2_B_LPHINT_MASK)

#define SLEEPCON0_LP_HINT1_SAI0_F_LPHINT_MASK    (0x800U)
#define SLEEPCON0_LP_HINT1_SAI0_F_LPHINT_SHIFT   (11U)
/*! SAI0_F_LPHINT - SAI0 Function Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT1_SAI0_F_LPHINT(x)      (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_SAI0_F_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT1_SAI0_F_LPHINT_MASK)

#define SLEEPCON0_LP_HINT1_SAI1_F_LPHINT_MASK    (0x1000U)
#define SLEEPCON0_LP_HINT1_SAI1_F_LPHINT_SHIFT   (12U)
/*! SAI1_F_LPHINT - SAI1 Function Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT1_SAI1_F_LPHINT(x)      (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_SAI1_F_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT1_SAI1_F_LPHINT_MASK)

