solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_SLEEPCON0.h
#define SLEEPCON0_LP_HINT1_SAI2_F_LPHINT_MASK    (0x2000U)
#define SLEEPCON0_LP_HINT1_SAI2_F_LPHINT_SHIFT   (13U)
/*! SAI2_F_LPHINT - SAI2 Function Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT1_SAI2_F_LPHINT(x)      (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_SAI2_F_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT1_SAI2_F_LPHINT_MASK)

#define SLEEPCON0_LP_HINT1_FLEXIO_B_LPHINT_MASK  (0x4000U)
#define SLEEPCON0_LP_HINT1_FLEXIO_B_LPHINT_SHIFT (14U)
/*! FLEXIO_B_LPHINT - FLEXIO Bus Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT1_FLEXIO_B_LPHINT(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_FLEXIO_B_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT1_FLEXIO_B_LPHINT_MASK)

#define SLEEPCON0_LP_HINT1_LPI2C15_B_LPHINT_MASK (0x8000U)
#define SLEEPCON0_LP_HINT1_LPI2C15_B_LPHINT_SHIFT (15U)
/*! LPI2C15_B_LPHINT - LPI2C15 Bus Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT1_LPI2C15_B_LPHINT(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_LPI2C15_B_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT1_LPI2C15_B_LPHINT_MASK)

#define SLEEPCON0_LP_HINT1_FLEXIO_F_LPHINT_MASK  (0x10000U)
#define SLEEPCON0_LP_HINT1_FLEXIO_F_LPHINT_SHIFT (16U)
/*! FLEXIO_F_LPHINT - FLEXIO Function Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT1_FLEXIO_F_LPHINT(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_FLEXIO_F_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT1_FLEXIO_F_LPHINT_MASK)

#define SLEEPCON0_LP_HINT1_LPI2C15_F_LPHINT_MASK (0x20000U)
#define SLEEPCON0_LP_HINT1_LPI2C15_F_LPHINT_SHIFT (17U)
/*! LPI2C15_F_LPHINT - LPI2C15 Function Clock Related Logic Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON0_LP_HINT1_LPI2C15_F_LPHINT(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_LPI2C15_F_LPHINT_SHIFT)) & SLEEPCON0_LP_HINT1_LPI2C15_F_LPHINT_MASK)

#define SLEEPCON0_LP_HINT1_NIC0_IDLE0_MASK       (0x40000U)
#define SLEEPCON0_LP_HINT1_NIC0_IDLE0_SHIFT      (18U)
/*! NIC0_IDLE0 - NIC_MEDIA0 Idle Status
 *  0b0..Active
 *  0b1..Idle
 */
#define SLEEPCON0_LP_HINT1_NIC0_IDLE0(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_NIC0_IDLE0_SHIFT)) & SLEEPCON0_LP_HINT1_NIC0_IDLE0_MASK)

#define SLEEPCON0_LP_HINT1_NIC0_IDLE1_MASK       (0x80000U)
#define SLEEPCON0_LP_HINT1_NIC0_IDLE1_SHIFT      (19U)
/*! NIC0_IDLE1 - NIC_MEDIA0 Idle Status
 *  0b0..Active
 *  0b1..Idle
 */
#define SLEEPCON0_LP_HINT1_NIC0_IDLE1(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_NIC0_IDLE1_SHIFT)) & SLEEPCON0_LP_HINT1_NIC0_IDLE1_MASK)

#define SLEEPCON0_LP_HINT1_NIC1_IDLE0_MASK       (0x100000U)
#define SLEEPCON0_LP_HINT1_NIC1_IDLE0_SHIFT      (20U)
/*! NIC1_IDLE0 - NIC_MEDIA1 Idle Status
 *  0b0..Active
 *  0b1..Idle
 */
#define SLEEPCON0_LP_HINT1_NIC1_IDLE0(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_NIC1_IDLE0_SHIFT)) & SLEEPCON0_LP_HINT1_NIC1_IDLE0_MASK)

#define SLEEPCON0_LP_HINT1_NIC1_IDLE1_MASK       (0x200000U)
#define SLEEPCON0_LP_HINT1_NIC1_IDLE1_SHIFT      (21U)
/*! NIC1_IDLE1 - NIC_MEDIA1 Idle Status
 *  0b0..Active
 *  0b1..Idle
 */
#define SLEEPCON0_LP_HINT1_NIC1_IDLE1(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_HINT1_NIC1_IDLE1_SHIFT)) & SLEEPCON0_LP_HINT1_NIC1_IDLE1_MASK)
/*! @} */

/*! @name LP_DENY0 - Low-Power Request Deny Status 0 */
/*! @{ */

#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM0_LPDENY_MASK (0x1U)
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM0_LPDENY_SHIFT (0U)
/*! LP_FLEXCOMM0_LPDENY - LP_FLEXCOMM0 Low-Power Deny Status
 *  0b0..Not deny
 *  0b1..Deny
 */
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM0_LPDENY(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_DENY0_LP_FLEXCOMM0_LPDENY_SHIFT)) & SLEEPCON0_LP_DENY0_LP_FLEXCOMM0_LPDENY_MASK)

#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM1_LPDENY_MASK (0x2U)
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM1_LPDENY_SHIFT (1U)
/*! LP_FLEXCOMM1_LPDENY - LP_FLEXCOMM1 Low-Power Deny Status
 *  0b0..Not deny
 *  0b1..Deny
 */
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM1_LPDENY(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_DENY0_LP_FLEXCOMM1_LPDENY_SHIFT)) & SLEEPCON0_LP_DENY0_LP_FLEXCOMM1_LPDENY_MASK)

#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM2_LPDENY_MASK (0x4U)
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM2_LPDENY_SHIFT (2U)
/*! LP_FLEXCOMM2_LPDENY - LP_FLEXCOMM2 Low-Power Deny Status
 *  0b0..Not deny
 *  0b1..Deny
 */
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM2_LPDENY(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_DENY0_LP_FLEXCOMM2_LPDENY_SHIFT)) & SLEEPCON0_LP_DENY0_LP_FLEXCOMM2_LPDENY_MASK)

#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM3_LPDENY_MASK (0x8U)
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM3_LPDENY_SHIFT (3U)
/*! LP_FLEXCOMM3_LPDENY - LP_FLEXCOMM3 Low-Power Deny Status
 *  0b0..Not deny
 *  0b1..Deny
 */
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM3_LPDENY(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_DENY0_LP_FLEXCOMM3_LPDENY_SHIFT)) & SLEEPCON0_LP_DENY0_LP_FLEXCOMM3_LPDENY_MASK)

#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM4_LPDENY_MASK (0x10U)
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM4_LPDENY_SHIFT (4U)
/*! LP_FLEXCOMM4_LPDENY - LP_FLEXCOMM4 Low-Power Deny Status
 *  0b0..Not deny
 *  0b1..Deny
 */
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM4_LPDENY(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_DENY0_LP_FLEXCOMM4_LPDENY_SHIFT)) & SLEEPCON0_LP_DENY0_LP_FLEXCOMM4_LPDENY_MASK)

#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM5_LPDENY_MASK (0x20U)
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM5_LPDENY_SHIFT (5U)
/*! LP_FLEXCOMM5_LPDENY - LP_FLEXCOMM5 Low-Power Deny Status
 *  0b0..Not deny
 *  0b1..Deny
 */
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM5_LPDENY(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_DENY0_LP_FLEXCOMM5_LPDENY_SHIFT)) & SLEEPCON0_LP_DENY0_LP_FLEXCOMM5_LPDENY_MASK)

#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM6_LPDENY_MASK (0x40U)
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM6_LPDENY_SHIFT (6U)
/*! LP_FLEXCOMM6_LPDENY - LP_FLEXCOMM6 Low-Power Deny Status
 *  0b0..Not deny
 *  0b1..Deny
 */
#define SLEEPCON0_LP_DENY0_LP_FLEXCOMM6_LPDENY(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON0_LP_DENY0_LP_FLEXCOMM6_LPDENY_SHIFT)) & SLEEPCON0_LP_DENY0_LP_FLEXCOMM6_LPDENY_MASK)

